#include "std.h"

void print_logo() {
	system("cls");
	printf("************************************************************************\n");
	printf("C 언어 도서 관리 프로그램\n");
	printf("2025-07-08\n");
	printf("오승하\n");
	printf("************************************************************************\n");
	system("pause");
}

char print_menu() {
	printf("************************************************************************\n");
	printf("[1] 도서 저장\n");
	printf("[2] 도서 번호로 검색\n");
	printf("[3] 도서명으로 검색\n");
	printf("[4] 도서 수정\n");
	printf("[5] 도서 삭제\n");
	printf("[0] 프로그램 종료\n");
	printf("************************************************************************\n");
	return _getch();

}

void print_ending() {
	system("cls");
	printf("************************************************************************\n");
	printf("프로그램을 종료합니다.\n");
	printf("************************************************************************\n");
	system("pause");
}